
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступность();
		
	ТекПользователь = Сервер.ПолучитьТекущегоПользователя();
	
	Если ТекПользователь = Запись.ПользовательПодписант Тогда 
		Если ЭтоНоваяЗаявка() Тогда
			АктивироватьЭлемент("ПодписатьЗаявку");
			АктивироватьЭлемент("ОтклонитьЗаявку");
		КонецЕсли;
	ИначеЕсли ТекПользователь = Запись.Пользователь Тогда 
		Если ЭтоНоваяЗаявка() Тогда 
			АктивироватьЭлемент("ОтменитьЗаявку");
			Если НачалоДня(Запись.Период) < НачалоДня(ТекущаяДата()) Тогда 
				АктивироватьЭлемент("УведомитьПовторно");
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Сервер.ЕстьПрава("ПолныеПрава") Тогда //Админу в помощь!
		АктивироватьЭлемент("ПодписатьЗаявку");
		АктивироватьЭлемент("ОтклонитьЗаявку");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьЭлемент(ИмяЭлемента)
	Элементы.Группа1.Видимость = Истина;
	Элементы.Группа1.Доступность = Истина;
	Элементы[ИмяЭлемента].Видимость = Истина;
	Элементы[ИмяЭлемента].Доступность = Истина;
КонецПроцедуры

&НаСервере
Функция ЭтоНоваяЗаявка()
	Возврат (Запись.Статус = Перечисления.СтатусыЗаявок.Новый);
КонецФункции

&НаКлиенте
Процедура УстановитьДоступность()
	ЕстьПолныеПрава = Сервер.ЕстьПрава("ПолныеПрава");
	//#Если ВебКлиент Тогда
	Для Каждого Эл Из ЭтаФорма.Элементы Цикл 		
		Попытка
			//Эл.Доступность = ЕстьПолныеПрава;
			Эл.ТолькоПросмотр = НЕ ЕстьПолныеПрава;
		Исключение
		КонецПопытки;
	КонецЦикла;
	//#Иначе
	//ЭтаФорма.Доступность = ЕстьПолныеПрава;
	//#КонецЕсли
	ЭтаФорма.КоманднаяПанель.Доступность = ЕстьПолныеПрава;
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьЗаявку(Команда)
	Клиент.ПодтвердитьЗаявку(Запись);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьЗаявку(Команда)
	Клиент.ОтклонитьЗаявку(Новый ОписаниеОповещения("ОтклонитьЗаявкуЗавершение", ЭтотОбъект), Запись);
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьЗаявкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗаявку(Команда)
	Клиент.ОтменитьЗаявку(Запись);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура УведомитьПовторно(Команда)
	Сервер.ОтправитьПисьмоПоЗаявке(Запись,ТекущаяДата());	
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Попытка
		ВладелецФормы.Элементы.Список.Обновить();
	Исключение
	КонецПопытки;
КонецПроцедуры
