
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьНовый();
	Элементы.Пользователь.Видимость = (Сервер.ЕстьПрава("ПолныеПрава") И ЗначениеЗаполнено(Запись.ПользовательОтслеживания));
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНовый()
	Если Не ЗначениеЗаполнено(Запись.Пользователь) Тогда 
		Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Попытка
	ВладелецФормы.Элементы.Список.Обновить();
	Исключение
	КонецПопытки;
КонецПроцедуры
