
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Параметры.ОтборПоПользователю) Тогда 
		Отказ = Истина;
		Возврат;
	Иначе
		Пользователь = Параметры.ОтборПоПользователю;
	КонецЕсли;
	ДатаНачала = НачалоДня(ТекущаяДата());
	ДатаОкончания = КонецДня(ТекущаяДата());
	УстановитьПараметры();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметры()
	//Список.Параметры.УстановитьЗначениеПараметра("НаДату", ПараметрыСеанса.ТекущаяДата);                
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователь);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииОтбора(Элемент)
	УстановитьПараметры();
	Элементы.Список.Обновить();
КонецПроцедуры
