
Процедура ПриНачалеРаботыСистемы()
	МассивДнейНедели = Новый Массив;
	МассивДнейНедели.Добавить("понедельник");
	МассивДнейНедели.Добавить("вторник");
	МассивДнейНедели.Добавить("среда");
	МассивДнейНедели.Добавить("четверг");
	МассивДнейНедели.Добавить("пятница");
	МассивДнейНедели.Добавить("суббота");
	МассивДнейНедели.Добавить("воскресенье");
	Сегодня = Формат(ТекущаяДата(), "ДФ=дд.ММ.гггг") + ", " + МассивДнейНедели.Получить(ДеньНедели(ТекущаяДата())-1);
	//УстановитьЗаголовокПриложения("СУРВ / "+Сегодня+" / "+СокрЛП(Сервер.ПолучитьТекущегоПользователя()));
	УстановитьЗаголовокПриложения("СУРВ / "+Сегодня);
КонецПроцедуры
