
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	ПараметрыСеанса.ТекущаяДата = ТекущаяДата();
	
	ПараметрыСеанса.ТекущийПользователь = Сервер.ПолучитьТекущегоПользователя(Ложь);
	
	ТЗ = РегистрыСведений.УчетРабочегоВремени.СрезПоследних(ТекущаяДата(),Новый Структура("Пользователь",ПараметрыСеанса.ТекущийПользователь));
	Если ТЗ.Количество() > 0 Тогда 
		ПослСобытие = ТЗ.Получить(ТЗ.Количество()-1);
		ПараметрыСеанса.ТекущийОфис = ПослСобытие.Офис;
	Иначе
		ПараметрыСеанса.ТекущийОфис = Справочники.Офисы.ПустаяСсылка();
	КонецЕсли;
	
	ПараметрыСеанса.ТекущийДомен = ПараметрыСеанса.ТекущийПользователь.Домен;
	
	ПараметрыСеанса.НавигационнаяСсылкаИБ = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
	
КонецПроцедуры
