
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ПоказатьВсе.Пометка = Ложь;
	УстановитьПараметрыЗапроса();
КонецПроцедуры

//&НаКлиенте
//Функция ПолучитьКлючТекущейЗаписи(ВВидеСтруктуры = Ложь)
//	ТекЗап = Элементы.Список.ТекущиеДанные;
//	Если ТекЗап <> Неопределено Тогда 
//		ЗначениеКлюча = Новый Структура;
//		ЗначениеКлюча.Вставить("Период",ТекЗап.Период);
//		ЗначениеКлюча.Вставить("Пользователь",ТекЗап.Пользователь);//Сервер.ПолучитьТекущегоПользователя(Истина));
//		ЗначениеКлюча.Вставить("ПользовательПодписант",ТекЗап.ПользовательПодписант);
//		ЗначениеКлюча.Вставить("ВидОтсутствия",ТекЗап.ВидОтсутствия);
//		ЗначениеКлюча.Вставить("ПериодНачала",ТекЗап.ПериодНачала);
//		ЗначениеКлюча.Вставить("ПериодОкончания",ТекЗап.ПериодОкончания);
//		Если ВВидеСтруктуры Тогда 
//			Возврат ЗначениеКлюча;
//		КонецЕсли;
//		МассивПараметров = Новый Массив;
//		МассивПараметров.Добавить(ЗначениеКлюча);    
//		КлючЗаписи = Новый("РегистрСведенийКлючЗаписи.ЗапросНаОтсутствие", МассивПараметров);
//	Иначе
//		КлючЗаписи = Неопределено;//Новый("РегистрСведенийКлючЗаписи.ЗапросНаОтсутствие");
//	КонецЕсли;
//	Возврат КлючЗаписи;
//КонецФункции

&НаКлиенте
Процедура ПодписатьЗаявку(Команда)
	//КлючЗаписи = ПолучитьКлючТекущейЗаписи();
	//Если КлючЗаписи <> Неопределено Тогда 
	//	Если Вопрос("Хотите подтвердить данную заявку?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда 
	//		ПодтвердитьЗаявку(КлючЗаписи);
	//	КонецЕсли;
	//КонецЕсли;
	Клиент.ПодтвердитьЗаявку(Элементы.Список.ТекущиеДанные);
	Элементы.Список.Обновить();
КонецПроцедуры

//&НаСервереБезКонтекста
//Процедура ПодтвердитьЗаявку(КлючЗаписи)
//	РегистрыСведений.ЗапросНаОтсутствие.ПодтвердитьЗаявку(КлючЗаписи);	
//КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьЗаявку(Команда)
	//Клиент.ОтклонитьЗаявку(Новый ОписаниеОповещения("ОтклонитьЗаявкуЗавершение", ЭтотОбъект), Элементы.Список.ТекущиеДанные);
	Клиент.ОтклонитьЗаявку(Элементы.Список.ТекущиеДанные);
	Элементы.Список.Обновить();
КонецПроцедуры

//&НаКлиенте
//Процедура ОтклонитьЗаявкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
//	
//	//КлючЗаписи = ПолучитьКлючТекущейЗаписи();
//	//Если КлючЗаписи <> Неопределено Тогда 
//	//	Если Вопрос("Хотите отклонить данную заявку?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда 
//	//		ОтклонитьЗаявку(КлючЗаписи);
//	//	КонецЕсли;
//	//КонецЕсли;
//	
//	Элементы.Список.Обновить();

//КонецПроцедуры

//&НаСервереБезКонтекста
//Процедура ОтклонитьЗаявку(КлючЗаписи,Статус)
//	РегистрыСведений.ЗапросНаОтсутствие.ОтклонитьЗаявку(КлючЗаписи);
//КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КлючЗаписи = Клиент.ПолучитьКлючТекущейЗаписи(Элементы.Список.ТекущиеДанные,Ложь);
	Если КлючЗаписи <> Неопределено Тогда
		ОткрытьФорму("РегистрСведений.ЗапросНаОтсутствие.Форма.ФормаПросмотра",Новый Структура("Ключ",КлючЗаписи),ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтобрать(Команда)
	Пометка = Не Элементы.ПоказатьВсе.Пометка;
	Элементы.ПоказатьВсе.Пометка = Пометка;
	//Элементы.ПоказатьВсе.Заголовок = ?(Пометка,"Показать все","Только новые");
	УстановитьПараметрыЗапроса();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыЗапроса()
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьВсе", Элементы.ПоказатьВсе.Пометка);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Список.Обновить();
КонецПроцедуры

