
Функция ПолучитьКлючТекущейЗаписи(ТекЗап,ВВидеСтруктуры = Ложь) Экспорт
	Если ТекЗап <> Неопределено Тогда 
		ЗначениеКлюча = Новый Структура;
		ЗначениеКлюча.Вставить("Период",ТекЗап.Период);
		Попытка
			ЗначениеКлюча.Вставить("Пользователь",ТекЗап.Пользователь);
		Исключение
			ЗначениеКлюча.Вставить("Пользователь",Сервер.ПолучитьТекущегоПользователя(Истина));
		КонецПопытки;
		ЗначениеКлюча.Вставить("ПользовательПодписант",ТекЗап.ПользовательПодписант);
		ЗначениеКлюча.Вставить("ВидОтсутствия",ТекЗап.ВидОтсутствия);
		ЗначениеКлюча.Вставить("ПериодНачала",ТекЗап.ПериодНачала);
		ЗначениеКлюча.Вставить("ПериодОкончания",ТекЗап.ПериодОкончания);
		Если ВВидеСтруктуры Тогда //на клиенте работаем со структурой!!
			Возврат ЗначениеКлюча;
		КонецЕсли;
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(ЗначениеКлюча);    
		КлючЗаписи = Новый("РегистрСведенийКлючЗаписи.ЗапросНаОтсутствие", МассивПараметров);
	Иначе
		КлючЗаписи = Неопределено;//Новый("РегистрСведенийКлючЗаписи.ЗапросНаОтсутствие");
	КонецЕсли;
	Возврат КлючЗаписи;
КонецФункции

Процедура ПодтвердитьЗаявку(ТекЗап) Экспорт
	КлючЗаписи = ПолучитьКлючТекущейЗаписи(ТекЗап,Истина);
	Если КлючЗаписи <> Неопределено Тогда 
		//Если Вопрос("Хотите подтвердить данную заявку?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда 
		//	Если Сервер.ПодтвердитьЗаявку(КлючЗаписи) Тогда 
		//		Предупреждение("Заявка подтверждена!",2);
		//	Иначе
		//		Предупреждение("Не удалось подтвердить заявку, возникла неизвестная ошибка!");
		//	КонецЕсли;
		//КонецЕсли;
		Если Не Сервер.ПодтвердитьЗаявку(КлючЗаписи) Тогда
			Сообщить("Не удалось подтвердить заявку, возникла неизвестная ошибка!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьЗаявку(ТекЗап) Экспорт
	КлючЗаписи = ПолучитьКлючТекущейЗаписи(ТекЗап,Истина);
	Если КлючЗаписи <> Неопределено Тогда 
		//Если Вопрос("Хотите отклонить данную заявку?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда 
			ПричинаОтказа = "";
			ПоказатьВводСтроки(Новый ОписаниеОповещения("ОтклонитьЗаявкуОкончание",Клиент,Новый Структура("КлючЗаписи",КлючЗаписи)),
								ПричинаОтказа,"Пожалуйста укажите причину отказа:",,Истина);			
		//КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьЗаявкуОкончание(ПричинаОтказа,ДополнительныеПараметры) Экспорт 
	КлючЗаписи = ДополнительныеПараметры.КлючЗаписи;
	//Если Сервер.ОтклонитьЗаявку(КлючЗаписи,ПричинаОтказа) Тогда 
	//	Предупреждение("Заявка отклонена!",2);
	//Иначе
	//	Предупреждение("Не удалось отклонить заявку, возникла неизвестная ошибка!");
	//КонецЕсли;
	Если Не Сервер.ОтклонитьЗаявку(КлючЗаписи,?(ПричинаОтказа = Неопределено,"",ПричинаОтказа)) Тогда 
		Сообщить("Не удалось отклонить заявку, возникла неизвестная ошибка!");
	КонецЕсли;
КонецПроцедуры

Процедура ОтменитьЗаявку(ТекЗап) Экспорт
	КлючЗаписи = Клиент.ПолучитьКлючТекущейЗаписи(ТекЗап,Истина);
	Если КлючЗаписи <> Неопределено Тогда 
		//Если Вопрос("Хотите отменить данную заявку?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		//	Если Сервер.ОтменитьЗаявку(КлючЗаписи) Тогда 
		//		Предупреждение("Заявка успешно удалена!",2);
		//	Иначе
		//		Предупреждение("Не удалось удалить заявку, т.к. она уже была подписана или отклонена!");
		//	КонецЕсли;
		//КонецЕсли;
		Если Не Сервер.ОтменитьЗаявку(КлючЗаписи) Тогда 
			Сообщить("Не удалось удалить заявку, т.к. она уже была подписана или отклонена!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры