
&НаКлиенте
Процедура Загрузить(Команда)
	ПараметрыСоединения = "Srvr="""+СокрЛП(Объект.Сервер)+""";Ref="""+СокрЛП(Объект.БазаДанных)+""";Usr="""+СокрЛП(Объект.Пользователь)+""";Pwd="""+СокрЛП(Объект.Пароль)+""";";
	Сервер.ЗагрузитьПроизводственныйКалендарь(ПараметрыСоединения,Объект.НаДату);
	ПоказатьПредупреждение(Неопределено, "Готово!",2);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.НаДату = ТекущаяДата();
	Объект.Сервер = "rumos04";
	Объект.БазаДанных = "mo_8";
	Объект.Пользователь = "Абасов А.А.";
КонецПроцедуры
