
&НаКлиенте
Процедура ЗаполнитьПустойДомен(Команда)
	ЗаполнитьПустыеДоменыВКалендаре();
	ПоказатьПредупреждение(Неопределено, "Готово!",2);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПустыеДоменыВКалендаре() Экспорт 
	Выборка = РегистрыСведений.РегламентированныйПроизводственныйКалендарь.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Не ЗначениеЗаполнено(Выборка.Домен) Тогда 
			Зап = РегистрыСведений.РегламентированныйПроизводственныйКалендарь.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Зап,Выборка);
			Зап.Домен = "ru";
			Зап.Записать();
			УдЗап = Выборка.ПолучитьМенеджерЗаписи();
			УдЗап.Удалить();			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
