
&НаКлиенте
Процедура ВыделитьВсе(Команда)
	УстановитьВсеФлагиЗагрузки(Истина);
	Элементы.ПользователиAD.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	УстановитьВсеФлагиЗагрузки(Ложь);
	Элементы.ПользователиAD.Обновить();
КонецПроцедуры

&НаСервере
Процедура УстановитьВсеФлагиЗагрузки(Флаг)
	Для Каждого СтрокаТЧ Из Объект.ПользователиAD Цикл 
		СтрокаТЧ.Загружать = Флаг;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	Если Не ЗначениеЗаполнено(Объект.Офис) Тогда 
		ПоказатьПредупреждение(Неопределено, "Не выбран Офис!");
		Возврат;
	КонецЕсли;
	ЗагрузкаПользователей();	
	Элементы.ПользователиAD.Обновить();
	ПоказатьПредупреждение(Неопределено, "Готово!",2);
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаПользователей()
	Объект.ПользователиAD.Очистить();
	ТаблицаДанных = Сервер.ПолучитьТаблицуПользователейИзAD(Объект.Офис);
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл 
		НовСтрокаТЧ = Объект.ПользователиAD.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрокаТЧ,СтрокаДанных);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПользователей(Команда)
	СозданиеПользователей();
	ПоказатьПредупреждение(Неопределено, "Готово",2);
КонецПроцедуры

&НаСервере
Процедура СозданиеПользователей()
	Сервер.ЗагрузитьПользователейОфиса(Объект.Офис,Объект.ПользователиAD,Истина);	//потом доделать выбор Офиса!
КонецПроцедуры
