
//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	СписокТиповБД = Сервер.ПолучитьСписокТиповБД();
//	Для Каждого Эл Из СписокТиповБД Цикл 
//		Элементы.ТипБД.СписокВыбора.Добавить(Эл.Значение,Эл.Представление);
//	КонецЦикла;
//КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ТипБДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	// Вставить содержимое обработчика.
//КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	Элементы.ТипБД.СписокВыбора = Сервер.ПолучитьСписокТиповБД();
//	Элементы.ТипБД.
//КонецПроцедуры
