
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ПоказатьВсе.Пометка = Ложь;
	УстановитьПараметрыЗапроса();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявку(Команда)
	ОткрытьФорму("РегистрСведений.ЗапросНаОтсутствие.Форма.ФормаВвода",Новый Структура("РежимСоздание",Истина),ЭтаФорма);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КлючЗаписи = Клиент.ПолучитьКлючТекущейЗаписи(Элементы.Список.ТекущиеДанные);
	Если КлючЗаписи <> Неопределено Тогда
		ОткрытьФорму("РегистрСведений.ЗапросНаОтсутствие.Форма.ФормаПросмотра",Новый Структура("Ключ",КлючЗаписи),ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗаявку(Команда)
	//КлючЗаписи = Клиент.ПолучитьКлючТекущейЗаписи(Элементы.Список.ТекущиеДанные);
	//Если КлючЗаписи <> Неопределено Тогда 
	//	Если Не ПопробоватьОтменитьЗаявку(КлючЗаписи) Тогда 
	//		Предупреждение("Невозможно удалить заявку, т.к. она уже была подписана или отклонена!");
	//	Иначе
	//		Предупреждение("Заявка успешно удалена!");
	//	КонецЕсли;
	//КонецЕсли;
	Клиент.ОтменитьЗаявку(Элементы.Список.ТекущиеДанные);
	Элементы.Список.Обновить();
КонецПроцедуры

//&НаКлиенте
//Функция ПолучитьКлючТекущейЗаписи(ВВидеСтруктуры = Ложь)
//	ТекЗап = Элементы.Список.ТекущиеДанные;
//	Если ТекЗап <> Неопределено Тогда 
//		ЗначениеКлюча = Новый Структура;
//		ЗначениеКлюча.Вставить("Период",ТекЗап.Период);
//		ЗначениеКлюча.Вставить("Пользователь",Сервер.ПолучитьТекущегоПользователя());//ТекЗап.Пользователь;
//		ЗначениеКлюча.Вставить("ПользовательПодписант",ТекЗап.ПользовательПодписант);
//		ЗначениеКлюча.Вставить("ВидОтсутствия",ТекЗап.ВидОтсутствия);
//		ЗначениеКлюча.Вставить("ПериодНачала",ТекЗап.ПериодНачала);
//		ЗначениеКлюча.Вставить("ПериодОкончания",ТекЗап.ПериодОкончания);
//		Если ВВидеСтруктуры Тогда 
//			Возврат ЗначениеКлюча;
//		КонецЕсли;
//		МассивПараметров = Новый Массив;
//		МассивПараметров.Добавить(ЗначениеКлюча);    
//		КлючЗаписи = Новый("РегистрСведенийКлючЗаписи.ЗапросНаОтсутствие", МассивПараметров);
//	Иначе
//		КлючЗаписи = Неопределено;//Новый("РегистрСведенийКлючЗаписи.ЗапросНаОтсутствие");
//	КонецЕсли;
//	Возврат КлючЗаписи;
//КонецФункции

//&НаСервере
//Функция ПопробоватьОтменитьЗаявку(КлючЗаписи)
//	Возврат РегистрыСведений.ЗапросНаОтсутствие.ОтменитьЗаявку(КлючЗаписи);
//КонецФункции

&НаКлиенте
Процедура ПоказатьОтобрать(Команда)
	Пометка = Не Элементы.ПоказатьВсе.Пометка;
	Элементы.ПоказатьВсе.Пометка = Пометка;
	//Элементы.ПоказатьВсе.Заголовок = ?(Пометка,"Показать все","Только новые");
	УстановитьПараметрыЗапроса();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыЗапроса()
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьВсе", Элементы.ПоказатьВсе.Пометка);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Список.Обновить();
КонецПроцедуры

