
Процедура ПередЗаписью(Отказ)
	
	Если ЗначениеЗаполнено(Email) И Найти(Email,"@") <> 0 И Не ЗначениеЗаполнено(Домен) Тогда 
		Домен = Прав(Email,2);
	//Иначе
	//	Домен = "";
	КонецЕсли;
	
	//заполним свои поля
	ТекРодитель = Родитель;
	Для х = 1 По 8 Цикл
		ЭтотОбъект["Родитель"+СокрЛП(х)] = ТекРодитель;
		ТекРодитель = ТекРодитель.Родитель;
	КонецЦикла;
	
	//заполним поля подчиненных элементов (без подчиненных)
	Если Не ЭтотОбъект.ОбменДанными.Загрузка И Не ЭтоНовый() Тогда 
	
		Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.Пользователи ГДЕ Родитель = &Родитель ИЛИ Родитель В ИЕРАРХИИ(&Родитель)");
		Запрос.УстановитьПараметр("Родитель",Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			Об = Выборка.Ссылка.ПолучитьОбъект();
			Об.ОбменДанными.Загрузка = Истина;
			Об.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
